## GroupBy: FL & 3 Other Control States

In [1]:
# Read the csv created by Shipment_Data_Extraction (Group1: FL & 3 Other States) 
import pandas as pd
FL= pd.read_csv("shipment_FL.csv")
FL.head()

,BUYER_STATE,BUYER_COUNTY,BUYER_ZIP,TRANSACTION_DATE,DRUG_CODE,CALC_BASE_WT_IN_GM,MME_Conversion_Factor,YEAR
0,FL,PALM BEACH,33460,8182006,9143,3.586,1.5,2006
1,FL,PALM BEACH,33460,11292006,9143,7.172,1.5,2006
2,FL,PALM BEACH,33460,2062007,9143,21.516,1.5,2007
3,FL,PALM BEACH,33460,3012007,9143,21.516,1.5,2007
4,FL,PALM BEACH,33460,4162007,9143,5.379,1.5,2007

In [2]:
#Calculate MME
FL['MME']=FL['MME_Conversion_Factor']*FL['CALC_BASE_WT_IN_GM']

In [3]:
#Rename YEAR Column
FL=FL.rename(columns={"YEAR": "YEAR/MONTH"})

In [4]:
#Drop the unnecessary columns
drop=['TRANSACTION_DATE','DRUG_CODE', 'CALC_BASE_WT_IN_GM', 'MME_Conversion_Factor','BUYER_ZIP']

In [5]:
FL1=FL.drop(drop,axis=1)

In [6]:
#Group By State, County, and Year
FL_agg=FL1.groupby(['BUYER_STATE','BUYER_COUNTY','YEAR/MONTH'],as_index=False).sum()

In [7]:
#Check the result to make sure everything looks right
FL_agg.head()

  BUYER_STATE BUYER_COUNTY  YEAR/MONTH            MME
0          FL      ALACHUA        2006   82596.618688
1          FL      ALACHUA        2007   95259.627977
2          FL      ALACHUA        2008  114675.221922
3          FL      ALACHUA        2009  141281.048185
4          FL      ALACHUA        2010  150910.785876

In [9]:
#Check if the MME sum is correct
FL1[(FL1['BUYER_STATE']=='FL') &(FL1['BUYER_COUNTY']=='ALACHUA') & (FL1['YEAR/MONTH']==2006)]['MME'].sum()

82596.618687725

## GroupBy: TX & 3 Other Control States

In [10]:
# Read the csv created by Shipment_Data_Extraction (Group2: TX & 3 Other States) 
TX= pd.read_csv("shipment_TX.csv")
TX.head()

,BUYER_STATE,BUYER_COUNTY,BUYER_ZIP,TRANSACTION_DATE,DRUG_CODE,CALC_BASE_WT_IN_GM,MME_Conversion_Factor,MONTH,MME
0,TX,GREGG,75662,1112006,9193,1.5135,1.0,1,1.51
1,TX,JEFFERSON,77706,1042006,9193,1.5135,1.0,1,1.51
2,TX,JEFFERSON,77706,11022006,9193,2.4216,1.0,11,2.42
3,TX,JEFFERSON,77706,1042007,9193,0.6054,1.0,1,0.61
4,TX,JEFFERSON,77706,2142007,9193,0.6054,1.0,2,0.61

In [11]:
#Rename the MONTH Column 
TX=TX.rename(columns={"MONTH": "YEAR/MONTH"})

In [12]:
#Change the values to MMYYYY Format
TX['YEAR/MONTH']= (TX['TRANSACTION_DATE'].astype(str).str[-4:] + TX['TRANSACTION_DATE'].astype(str).str[:-6]).astype(int)

In [13]:
#Check the result to make sure everything looks right
TX.head()

,BUYER_STATE,BUYER_COUNTY,BUYER_ZIP,TRANSACTION_DATE,DRUG_CODE,CALC_BASE_WT_IN_GM,MME_Conversion_Factor,YEAR/MONTH,MME
0,TX,GREGG,75662,1112006,9193,1.5135,1.0,20061,1.51
1,TX,JEFFERSON,77706,1042006,9193,1.5135,1.0,20061,1.51
2,TX,JEFFERSON,77706,11022006,9193,2.4216,1.0,200611,2.42
3,TX,JEFFERSON,77706,1042007,9193,0.6054,1.0,20071,0.61
4,TX,JEFFERSON,77706,2142007,9193,0.6054,1.0,20072,0.61

In [14]:
#Drop the unnecessary columns
TX1=TX.drop(axis=1,columns=drop)

In [15]:
#Check the result to make sure everything looks right
TX1.head()

  BUYER_STATE BUYER_COUNTY  YEAR/MONTH   MME
0          TX        GREGG       20061  1.51
1          TX    JEFFERSON       20061  1.51
2          TX    JEFFERSON      200611  2.42
3          TX    JEFFERSON       20071  0.61
4          TX    JEFFERSON       20072  0.61

In [16]:
#Group By State, County, and Year/Month
TX_agg=TX1.groupby(['BUYER_STATE','BUYER_COUNTY','YEAR/MONTH'],as_index=False).sum()

In [17]:
#Check the result to make sure everything looks right
TX_agg.head()

  BUYER_STATE BUYER_COUNTY  YEAR/MONTH     MME
0          AR     ARKANSAS       20061  391.34
1          AR     ARKANSAS       20062  294.16
2          AR     ARKANSAS       20063  400.71
3          AR     ARKANSAS       20064  333.35
4          AR     ARKANSAS       20065  395.37

In [18]:
#Check if the MME sum is correct
TX1[(TX1['BUYER_STATE']=='AR') &(TX1['BUYER_COUNTY']=='ARKANSAS') & (TX1['YEAR/MONTH']==20061)]['MME'].sum()

391.34000000000003

## GroupBy: WA & 3 Other Control States

In [19]:
# Read the csv created by Shipment_Data_Extraction (Group3:WA & 3 Other States) 
WA= pd.read_csv("shipment_WA.csv")
WA.head()

,BUYER_STATE,BUYER_COUNTY,BUYER_ZIP,TRANSACTION_DATE,DRUG_CODE,CALC_BASE_WT_IN_GM,MME_Conversion_Factor,MONTH,MME
0,CA,VENTURA,93003,2092007,9193,0.60540,1.0,2,0.61
1,CO,PUEBLO,81005,1122009,9193,0.45405,1.0,1,0.45
2,WA,CLALLAM,98331,6152006,9193,3.63240,1.0,6,3.63
3,WA,CLALLAM,98331,10132006,9193,0.30270,1.0,10,0.30
4,WA,PIERCE,98390,3122007,9143,5.37900,1.5,3,8.07

In [20]:
WA=WA.rename(columns={"MONTH": "YEAR/MONTH"})

In [21]:
#Change the values to MMYYYY Format
WA['YEAR/MONTH']= (WA['TRANSACTION_DATE'].astype(str).str[-4:] + WA['TRANSACTION_DATE'].astype(str).str[:-6]).astype(int)

In [22]:
#Check the result to make sure everything looks right
WA.head()

,BUYER_STATE,BUYER_COUNTY,BUYER_ZIP,TRANSACTION_DATE,DRUG_CODE,CALC_BASE_WT_IN_GM,MME_Conversion_Factor,YEAR/MONTH,MME
0,CA,VENTURA,93003,2092007,9193,0.60540,1.0,20072,0.61
1,CO,PUEBLO,81005,1122009,9193,0.45405,1.0,20091,0.45
2,WA,CLALLAM,98331,6152006,9193,3.63240,1.0,20066,3.63
3,WA,CLALLAM,98331,10132006,9193,0.30270,1.0,200610,0.30
4,WA,PIERCE,98390,3122007,9143,5.37900,1.5,20073,8.07

In [24]:
#Drop the unnecessary columns
WA1=WA.drop(axis=1,columns=drop)

In [25]:
#Group By State, County, and Year/Month
WA_agg=WA1.groupby(['BUYER_STATE','BUYER_COUNTY','YEAR/MONTH'],as_index=False).sum()

In [26]:
#Check the result to make sure everything looks right
WA_agg.head()

  BUYER_STATE BUYER_COUNTY  YEAR/MONTH       MME
0          CA      ALAMEDA       20061  29511.44
1          CA      ALAMEDA       20062  25124.56
2          CA      ALAMEDA       20063  33543.35
3          CA      ALAMEDA       20064  28110.13
4          CA      ALAMEDA       20065  29204.35

In [28]:
#Check if the MME sum is correct
WA1[(WA1['BUYER_STATE']=='CA') &(WA1['BUYER_COUNTY']=='ALAMEDA') & (WA1['YEAR/MONTH']==20061)]['MME'].sum()

29511.44

## Concatenate all 3 dataframes into one big dataframe

In [29]:
SHIPMENT_agg = pd.concat([FL_agg, TX_agg, WA_agg], axis=0)

In [32]:
#Check the result to make sure everything looks good 
SHIPMENT_agg['BUYER_STATE'].value_counts()

TX    18727
KS     8340
AR     6250
CA     4799
CO     4728
WA     3276
OR     2879
NM     2466
MS      567
FL      466
LA      443
SC      322
Name: BUYER_STATE, dtype: int64

In [33]:
#Convert to CSV
SHIPMENT_agg.to_csv(r'/Users/Dean Huang/Documents/Duke University (MIDS 2022)/Fall 2020/IDS 720/Team Project/SHIPMENT_agg.csv',index=False, header=True)